<?php
/* @var $this SiteController */

$this->pageTitle=Yii::app()->name;
?>

<h2>
Русский язык от А до Я: Малая энциклопедия.
</h2>

<div class="article">
<p>
Словарь содержит толкование более 1300 лингвистических терминов и понятий, относящихся к сфере языкознания. Словник, составленный на основе школьного курса русского языка и вузовских дисциплин «Введение в языкознание», «Современный русский язык», отражает базовые, актуальные понятия, без которых рассмотрение основ современной лингвистической науки как в средней, так и высшей школе было бы невозможным либо недостаточным. Раскрытие содержания лингвистических понятий, если того требует предмет изложения, ведется в разъяснительном ключе с выделением дискуссионных вопросов, спорных точек зрения, существующих в школьной и научной грамматике. Особое внимание уделяется различным аспектам языкового анализа. В соответствии с вышеизложенными принципами словарь может быть отнесен к категории учебных (не академических), способствующих усвоению дисциплин и расширению лингвистического кругозора.
</p>

<p>
Учитывая достижения в теории металингвистики и опыте составления терминологических словарей (см. список литературы и словарей), автор стремится к непротиворечивому сочетанию в словарной статье научных определений термина и контекстной формы его истолкования. Таким образом, в отличие от традиционных терминологических словарей, здесь не только объясняются термины, раскрывается их этимология, но и приводятся развернутые сведения о самих языковых явлениях, их месте в системе других, смежных с ними понятий. Словарные статьи содержат богатый иллюстративный материал из художественной, публицистической литературы, разговорной речи. Материал излагается системно, чему способствует большое количество таблиц и схем, позволяющих представить языковые факты и комментарий к ним наглядно и обобщенно. Объем приводимых сведений позволяет читателю получить основы лингвистического знания.
</p>

<p>
Особенность словаря состоит в том, что сведения о языке организованы в нем по тематическому принципу. Словарь открывается разделом «I. Общие сведения о языке». В отдельный раздел выделены вопросы истории и теории письма – «II. Графика. Орфография. История и теория письма». Затем следуют разделы, соответствующие уровням языковой системы и межуровневым категориям: «III. Фонетика. Основы фонологии», «IV. Лексикология. Фразеология», «V. Морфемика. Словообразование», «VII. Морфология», «VIII. Синтаксис». Чтобы не перегружать два последних раздела, общие понятия грамматики, главным образом проблемы частей речи, грамматических категорий, выделены в особый раздел «VI. Теоретические вопросы грамматики». Внутри тематических разделов словарные статьи расположены в алфавитном порядке.
</p>

<p>
Таким образом, словарь не только может служить справочником по какому-либо одному частному языковому явлению, но стремится отразить единство в системе понятий фонетики, лексики, грамматики преимущественно современного русского языка. Освещены также основные вопросы его истории.
</p>
</div>

